Autodesk.Revit.DB.ZoomType
An enumerated type listing all Zoom types of Print Setting.

Autodesk.Revit.DB.ZoomType.Zoom
The type of Zoom is user defined.

Autodesk.Revit.DB.ZoomType.FitToPage
The type of Zoom is Fit To Page.